export default function optionItem(props){
    return(
        <div className="optionItem">
            <img src={props.img} alt="item"/>
            <h3>{props.name}</h3>
            <p>{props.desc}</p>
            <button>
                Подробнее
                <svg xmlns="http://www.w3.org/2000/svg" width="10" height="8" viewBox="0 0 10 8" fill="none">
                    <path d="M5.97848 1.68681C5.78322 1.49154 5.78322 1.17496 5.97848 0.979699C6.17374 0.784436 6.49032 0.784436 6.68559 0.979699L9.35225 3.64637C9.54751 3.84163 9.54751 4.15821 9.35225 4.35347L6.68559 7.02014C6.49032 7.2154 6.17374 7.2154 5.97848 7.02014C5.78322 6.82488 5.78322 6.5083 5.97848 6.31303L7.79159 4.49992H1.33203C1.05589 4.49992 0.832031 4.27606 0.832031 3.99992C0.832031 3.72378 1.05589 3.49992 1.33203 3.49992H7.79159L5.97848 1.68681Z" fill="black"/>
                </svg>
            </button>
        </div>
    )
}
